import { toPrice } from '../src/functions/toPrice';
import { getThousandSeparator } from './#lib/getThousandSeparator';
import { getLiteral } from '../src/functions/getLiteral';

const FR_TS = getThousandSeparator( 'fr-FR' );
const LI = getLiteral();
const UINT256_MAX = 115792089237316195423570985008687907853269984665640564039457584007913129639935n;
const NUMBER_MAX = Number.MAX_SAFE_INTEGER;

// 文字列に含まれる特殊文字を半角スペースに変換する関数。
// (桁区切り文字や、数値と通貨記号の間に特殊スペースが含まれるため。)
const normalizePrice = ( price: string ) => {
	return price.replaceAll( FR_TS, ' ' ).replaceAll( LI, ' ' );
};

// 法定通貨の場合は`Intl.NumberFormat::format`を実行するだけなので
// テストはほとんど記述しない。
test.each`
	amount      | decimals | symbol     | locales        | expected
	${ 100000 } | ${ 2 }   | ${ 'JPY' } | ${ undefined } | ${ '¥1,000' }
	${ 100000 } | ${ 2 }   | ${ 'JPY' } | ${ 'en-US' }   | ${ '¥1,000' }
	${ 100000 } | ${ 2 }   | ${ 'JPY' } | ${ 'ja-JP' }   | ${ '￥1,000' }
	${ 100000 } | ${ 2 }   | ${ 'JPY' } | ${ 'fr-FR' }   | ${ `1 000 JPY` }
	${ 100000 } | ${ 2 }   | ${ 'JPY' } | ${ 'de-DE' }   | ${ `1.000 ¥` }
	${ 100000 } | ${ 2 }   | ${ 'USD' } | ${ undefined } | ${ '$1,000.00' }
	${ 100000 } | ${ 2 }   | ${ 'USD' } | ${ 'en-US' }   | ${ '$1,000.00' }
	${ 100000 } | ${ 2 }   | ${ 'USD' } | ${ 'ja-JP' }   | ${ '$1,000.00' }
	${ 100000 } | ${ 2 }   | ${ 'USD' } | ${ 'fr-FR' }   | ${ `1 000,00 $US` }
	${ 100000 } | ${ 2 }   | ${ 'USD' } | ${ 'de-DE' }   | ${ '1.000,00 $' }
`(
	'toPrice($amount, $decimals, $symbol, $locales) === $expected',
	( { amount, decimals, symbol, locales, expected } ) => {
		expect( normalizePrice( toPrice( amount, decimals, symbol, locales ) ) ).toBe( expected );
	}
);

test.each`
	case                             | amount           | decimals | symbol         | locales        | expected
	${ 'ゼロ' }                      | ${ 0n }          | ${ 0 }   | ${ 'ETH' }     | ${ undefined } | ${ '0 ETH' }
	${ '  - decimlasもゼロ' }        | ${ 0n }          | ${ 0 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 0 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 0 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 0 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0 ETH' }
	${ 'ゼロ' }                      | ${ 0n }          | ${ 1 }   | ${ 'ETH' }     | ${ undefined } | ${ '0 ETH' }
	${ '  - decimlasは1' }           | ${ 0n }          | ${ 1 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 1 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 1 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 1 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0 ETH' }
	${ 'ゼロ' }                      | ${ 0n }          | ${ 18 }  | ${ 'ETH' }     | ${ undefined } | ${ '0 ETH' }
	${ '  - decimlasは1より大きい' } | ${ 0n }          | ${ 18 }  | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 18 }  | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 18 }  | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0 ETH' }
	${ '' }                          | ${ 0n }          | ${ 18 }  | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0 ETH' }
	${ '1桁(decimlasはゼロ)' }       | ${ 1n }          | ${ 0 }   | ${ 'ETH' }     | ${ undefined } | ${ '1 ETH' }
	${ '' }                          | ${ 1n }          | ${ 0 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '1 ETH' }
	${ '' }                          | ${ 1n }          | ${ 0 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '1 ETH' }
	${ '' }                          | ${ 1n }          | ${ 0 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '1 ETH' }
	${ '' }                          | ${ 1n }          | ${ 0 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '1 ETH' }
	${ '1桁(decimlasは1)' }          | ${ 1n }          | ${ 1 }   | ${ 'ETH' }     | ${ undefined } | ${ '0.1 ETH' }
	${ '' }                          | ${ 1n }          | ${ 1 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0.1 ETH' }
	${ '' }                          | ${ 1n }          | ${ 1 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0.1 ETH' }
	${ '' }                          | ${ 1n }          | ${ 1 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0,1 ETH' }
	${ '' }                          | ${ 1n }          | ${ 1 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0,1 ETH' }
	${ '1桁' }                       | ${ 1n }          | ${ 18 }  | ${ 'ETH' }     | ${ undefined } | ${ '0.000000000000000001 ETH' }
	${ '  - decimlasは1より大きい' } | ${ 1n }          | ${ 18 }  | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0.000000000000000001 ETH' }
	${ '' }                          | ${ 1n }          | ${ 18 }  | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0.000000000000000001 ETH' }
	${ '' }                          | ${ 1n }          | ${ 18 }  | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0,000000000000000001 ETH' }
	${ '' }                          | ${ 1n }          | ${ 18 }  | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0,000000000000000001 ETH' }
	${ '2桁' }                       | ${ 12n }         | ${ 0 }   | ${ 'ETH' }     | ${ undefined } | ${ '12 ETH' }
	${ '  - decimlasはゼロ' }        | ${ 12n }         | ${ 0 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '12 ETH' }
	${ '' }                          | ${ 12n }         | ${ 0 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '12 ETH' }
	${ '' }                          | ${ 12n }         | ${ 0 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '12 ETH' }
	${ '' }                          | ${ 12n }         | ${ 0 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '12 ETH' }
	${ '2桁' }                       | ${ 12n }         | ${ 1 }   | ${ 'ETH' }     | ${ undefined } | ${ '1.2 ETH' }
	${ '  - decimlasは1' }           | ${ 12n }         | ${ 1 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '1.2 ETH' }
	${ '' }                          | ${ 12n }         | ${ 1 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '1.2 ETH' }
	${ '' }                          | ${ 12n }         | ${ 1 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '1,2 ETH' }
	${ '' }                          | ${ 12n }         | ${ 1 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '1,2 ETH' }
	${ '2桁' }                       | ${ 12n }         | ${ 2 }   | ${ 'ETH' }     | ${ undefined } | ${ '0.12 ETH' }
	${ '  - decimlasは2' }           | ${ 12n }         | ${ 2 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0.12 ETH' }
	${ '' }                          | ${ 12n }         | ${ 2 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0.12 ETH' }
	${ '' }                          | ${ 12n }         | ${ 2 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0,12 ETH' }
	${ '' }                          | ${ 12n }         | ${ 2 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0,12 ETH' }
	${ '2桁' }                       | ${ 12n }         | ${ 18 }  | ${ 'ETH' }     | ${ undefined } | ${ '0.000000000000000012 ETH' }
	${ '  - decimlasは2より大きい' } | ${ 12n }         | ${ 18 }  | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0.000000000000000012 ETH' }
	${ '' }                          | ${ 12n }         | ${ 18 }  | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0.000000000000000012 ETH' }
	${ '' }                          | ${ 12n }         | ${ 18 }  | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0,000000000000000012 ETH' }
	${ '' }                          | ${ 12n }         | ${ 18 }  | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0,000000000000000012 ETH' }
	${ '5桁' }                       | ${ 12345n }      | ${ 0 }   | ${ 'ETH' }     | ${ undefined } | ${ '12,345 ETH' }
	${ '  - decimlasはゼロ' }        | ${ 12345n }      | ${ 0 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '12,345 ETH' }
	${ '  - 桁区切り文字が入る' }    | ${ 12345n }      | ${ 0 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '12,345 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 0 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '12 345 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 0 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '12.345 ETH' }
	${ '5桁' }                       | ${ 12345n }      | ${ 1 }   | ${ 'ETH' }     | ${ undefined } | ${ '1,234.5 ETH' }
	${ '  - decimlasは1' }           | ${ 12345n }      | ${ 1 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '1,234.5 ETH' }
	${ '  - 桁区切り文字が' }        | ${ 12345n }      | ${ 1 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '1,234.5 ETH' }
	${ '    ギリギリ入る' }          | ${ 12345n }      | ${ 1 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '1 234,5 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '1.234,5 ETH' }
	${ '5桁' }                       | ${ 12345n }      | ${ 2 }   | ${ 'ETH' }     | ${ undefined } | ${ '123.45 ETH' }
	${ '  - decimlasは2' }           | ${ 12345n }      | ${ 2 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '123.45 ETH' }
	${ '  - 桁区切り文字が' }        | ${ 12345n }      | ${ 2 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '123.45 ETH' }
	${ '    ギリギリ入らない' }      | ${ 12345n }      | ${ 2 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '123,45 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 2 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '123,45 ETH' }
	${ '5桁' }                       | ${ 12345n }      | ${ 5 }   | ${ 'ETH' }     | ${ undefined } | ${ '0.12345 ETH' }
	${ '  - decimlasは5' }           | ${ 12345n }      | ${ 5 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0.12345 ETH' }
	${ '  - 結果が0.1以上1未満' }    | ${ 12345n }      | ${ 5 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0.12345 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 5 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0,12345 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 5 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0,12345 ETH' }
	${ '5桁' }                       | ${ 12345n }      | ${ 18 }  | ${ 'ETH' }     | ${ undefined } | ${ '0.000000000000012345 ETH' }
	${ '  - decimlasは2より大きい' } | ${ 12345n }      | ${ 18 }  | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0.000000000000012345 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 18 }  | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0.000000000000012345 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 18 }  | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0,000000000000012345 ETH' }
	${ '' }                          | ${ 12345n }      | ${ 18 }  | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0,000000000000012345 ETH' }
	${ 'Uint256_MAX' }               | ${ UINT256_MAX } | ${ 0 }   | ${ 'ETH' }     | ${ undefined } | ${ '115,792,089,237,316,195,423,570,985,008,687,907,853,269,984,665,640,564,039,457,584,007,913,129,639,935 ETH' }
	${ '  - decimlasはゼロ' }        | ${ UINT256_MAX } | ${ 0 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '115,792,089,237,316,195,423,570,985,008,687,907,853,269,984,665,640,564,039,457,584,007,913,129,639,935 ETH' }
	${ '' }                          | ${ UINT256_MAX } | ${ 0 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '115,792,089,237,316,195,423,570,985,008,687,907,853,269,984,665,640,564,039,457,584,007,913,129,639,935 ETH' }
	${ '' }                          | ${ UINT256_MAX } | ${ 0 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '115 792 089 237 316 195 423 570 985 008 687 907 853 269 984 665 640 564 039 457 584 007 913 129 639 935 ETH' }
	${ '' }                          | ${ UINT256_MAX } | ${ 0 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '115.792.089.237.316.195.423.570.985.008.687.907.853.269.984.665.640.564.039.457.584.007.913.129.639.935 ETH' }
	${ 'Uint256_MAX' }               | ${ UINT256_MAX } | ${ 18 }  | ${ 'ETH' }     | ${ undefined } | ${ '115,792,089,237,316,195,423,570,985,008,687,907,853,269,984,665,640,564,039,457.584007913129639935 ETH' }
	${ '  - decimlasは18' }          | ${ UINT256_MAX } | ${ 18 }  | ${ 'ETH' }     | ${ 'en-US' }   | ${ '115,792,089,237,316,195,423,570,985,008,687,907,853,269,984,665,640,564,039,457.584007913129639935 ETH' }
	${ '' }                          | ${ UINT256_MAX } | ${ 18 }  | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '115,792,089,237,316,195,423,570,985,008,687,907,853,269,984,665,640,564,039,457.584007913129639935 ETH' }
	${ '' }                          | ${ UINT256_MAX } | ${ 18 }  | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '115 792 089 237 316 195 423 570 985 008 687 907 853 269 984 665 640 564 039 457,584007913129639935 ETH' }
	${ '' }                          | ${ UINT256_MAX } | ${ 18 }  | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '115.792.089.237.316.195.423.570.985.008.687.907.853.269.984.665.640.564.039.457,584007913129639935 ETH' }
	${ 'Number型の最大値' }          | ${ NUMBER_MAX }  | ${ 0 }   | ${ 'ETH' }     | ${ undefined } | ${ '9,007,199,254,740,991 ETH' }
	${ '  - decimlasはゼロ' }        | ${ NUMBER_MAX }  | ${ 0 }   | ${ 'ETH' }     | ${ 'en-US' }   | ${ '9,007,199,254,740,991 ETH' }
	${ '' }                          | ${ NUMBER_MAX }  | ${ 0 }   | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '9,007,199,254,740,991 ETH' }
	${ '' }                          | ${ NUMBER_MAX }  | ${ 0 }   | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '9 007 199 254 740 991 ETH' }
	${ '' }                          | ${ NUMBER_MAX }  | ${ 0 }   | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '9.007.199.254.740.991 ETH' }
	${ 'Number型の最大値' }          | ${ NUMBER_MAX }  | ${ 18 }  | ${ 'ETH' }     | ${ undefined } | ${ '0.009007199254740991 ETH' }
	${ '  - decimlasは18' }          | ${ NUMBER_MAX }  | ${ 18 }  | ${ 'ETH' }     | ${ 'en-US' }   | ${ '0.009007199254740991 ETH' }
	${ '' }                          | ${ NUMBER_MAX }  | ${ 18 }  | ${ 'ETH' }     | ${ 'ja-JP' }   | ${ '0.009007199254740991 ETH' }
	${ '' }                          | ${ NUMBER_MAX }  | ${ 18 }  | ${ 'ETH' }     | ${ 'fr-FR' }   | ${ '0,009007199254740991 ETH' }
	${ '' }                          | ${ NUMBER_MAX }  | ${ 18 }  | ${ 'ETH' }     | ${ 'de-DE' }   | ${ '0,009007199254740991 ETH' }
	${ 'symbolがundefinedの場合' }   | ${ 12345n }      | ${ 1 }   | ${ undefined } | ${ undefined } | ${ '1,234.5' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ undefined } | ${ 'en-US' }   | ${ '1,234.5' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ undefined } | ${ 'ja-JP' }   | ${ '1,234.5' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ undefined } | ${ 'fr-FR' }   | ${ '1 234,5' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ undefined } | ${ 'de-DE' }   | ${ '1.234,5' }
	${ 'symbolが空文字の場合' }      | ${ 12345n }      | ${ 1 }   | ${ '' }        | ${ undefined } | ${ '1,234.5' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ '' }        | ${ 'en-US' }   | ${ '1,234.5' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ '' }        | ${ 'ja-JP' }   | ${ '1,234.5' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ '' }        | ${ 'fr-FR' }   | ${ '1 234,5' }
	${ '' }                          | ${ 12345n }      | ${ 1 }   | ${ '' }        | ${ 'de-DE' }   | ${ '1.234,5' }
`(
	'toPrice($amount, $decimals, $symbol, $locales) === $expected',
	( { amount, decimals, symbol, locales, expected } ) => {
		expect( normalizePrice( toPrice( amount, decimals, symbol, locales ) ) ).toBe( expected );
	}
);

// amount が負の数の場合
test( 'toPrice(-1, 0, "ETH") throws RangeError', () => {
	expect( () => toPrice( -1, 0, 'ETH' ) ).toThrow( RangeError );
} );

// decimals が負の数の場合
test( 'toPrice(1, -1, "ETH") throws RangeError', () => {
	expect( () => toPrice( 1, -1, 'ETH' ) ).toThrow( RangeError );
} );
